pl-sql/1-1.org
#+title: 1-1: Introduction to PL/SQL
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+OPTIONS: num:nil

* Vocabulary
1. Programming language features such as reusable/callable program units,
   modular blocks, cursors, constants, variables, assignment statements,
   conditional control statements, and loops

   *Procedural Constructs*

2. Oracle Corporations standard procedural language for relational databases
   which allows basic program logic and control flow to be combined with SQL
   statements

   *PL/SQL*

* Try/Solve it

1. Match the criteria

   | Criteria                             | Language |
   |--------------------------------------+----------|
   | 3GL                                  | *PL/SQL* |
   | 4GL                                  | *SQL*    |
   | Is proprietary to Oracle Corporation | *PL/SQL* |
   | Nonprocedural                        | *SQL*    |
   | Procedural                           | *PL/SQL* |
   | Is ANSI-compliant                    | *SQL*    |

2. In your own words, describe why a procedural language like PL/SQL is needed.

   *Error handling, transaction management, reusabillity*.

3. List some examples of procedural constructs in PL/SQL.

   1. Anonymous block

   2. Variables

   3. Functions

   4. Conditional statements

   5. Loops

   6. Cursors

   7. Exceptions

   8. Triggers

4. In the following code, identify (circle or highlight) examples of these
   procedural constructs: variable, conditional control statement,
   reusable/callable program unit, and an assignment statement.

   #+begin_src sql
    DECLARE
        v_first_name varchar2(40); -- variable declaration
        v_last_name varchar2(40); -- variable declaration
        v_first_letter varchar2(1); -- variable declaration
    BEGIN
        SELECT first_name, last_name INTO v_first_name, v_last_name
            FROM students
            WHERE student_id = 105; -- conditional statement
        v_first_letter := get_first_letter(v_last_name); -- assignment statement
        IF 'N' > 'v_first_letter' THEN -- conditional statement
            DBMS_OUTPUT.PUT_LINE('The last name for ' || v_first_name || ' '
                                    || v_last_name || ' is between A and M');
        ELSE
            DBMS_OUTPUT.PUT_LINE('The last name for ' || v_first_name || ' '
                                    || v_last_name || ' is between N and Z');
        END IF;
    END;
    #+end_src

    The comments of the code are the "highlights".
